
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 7 to change, 1 to destroy.</code></pre>

* Create
  * module.bad-response-codes-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.db.azurerm_resource_group.data-resourcegroup
  * module.db.azurerm_template_deployment.postgres-paas
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
* Delete
  * module.bad-response-codes-alert.azurerm_template_deployment.custom_alert[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.Insights/components/draft-store-service-appinsights-sandbox"
        name                                  = "draft-store-service-appinsights-sandbox"
      ~ tags                                  = {
          ~ "expiresAfter"        = "2023-03-15" -> "3000-01-01"
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox"
        name     = "draft-store-service-sandbox"
      ~ tags     = {
          ~ "expiresAfter"        = "2023-03-15" -> "3000-01-01"
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.bad-response-codes-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "Draft-store-bad-response-codes"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = "RPE alerts - sandbox"
              + actionGroupRg            = "rpe-sandbox"
              + alertDesc                = "404 for /health and 5xx response codes"
              + alertName                = "Draft-store-bad-response-codes"
              + appInsightsName          = "draft-store-service-appinsights-sandbox"
              + appInsightsQuery         = <<-EOT
                    requests
                    | where ((name == "GET /health" and resultCode == "404") or resultCode startswith "5")
                    | where operation_SyntheticSource !endswith "smoke test"
                EOT
              + commonTags               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZHJhZnQtc3RvcmUuZ2l0IiwiYXBwbGljYXRpb24iOiJjb3JlIiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNwbGF0b3BzLWhlbHAiLCJlbnZpcm9ubWVudCI6InNhbmRib3giLCJleHBpcmVzQWZ0ZXIiOiIzMDAwLTAxLTAxIiwibWFuYWdlZEJ5IjoiU29mdHdhcmUgRW5naW5lZXJpbmcifQ=="
              + customEmailSubject       = "Draft store - bad response codes detected"
              + frequencyInMinutes       = 5
              + location                 = "UK South"
              + severityLevel            = "3"
              + timeWindowInMinutes      = 5
              + triggerThreshold         = 0
              + triggerThresholdOperator = "GreaterThan"
            }
        )
      + resource_group_name = "draft-store-service-sandbox"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.bad-response-codes-alert.azurerm_template_deployment.custom_alert[0] will be destroyed
  # (because azurerm_template_deployment.custom_alert is not in configuration)
  - resource "azurerm_template_deployment" "custom_alert" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.Resources/deployments/Draft-store-bad-response-codes" -> null
      - name                = "Draft-store-bad-response-codes" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "actionGroupName"          = "RPE alerts - sandbox"
          - "actionGroupRg"            = "rpe-sandbox"
          - "alertDesc"                = "404 for /health and 5xx response codes"
          - "alertName"                = "Draft-store-bad-response-codes"
          - "appInsightsName"          = "draft-store-service-appinsights-sandbox"
          - "appInsightsQuery"         = <<-EOT
                requests
                | where ((name == "GET /health" and resultCode == "404") or resultCode startswith "5")
                | where operation_SyntheticSource !endswith "smoke test"
            EOT
          - "commonTags"               = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZHJhZnQtc3RvcmUuZ2l0IiwiYXBwbGljYXRpb24iOiJjb3JlIiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNwbGF0b3BzLWhlbHAiLCJlbnZpcm9ubWVudCI6InNhbmRib3giLCJleHBpcmVzQWZ0ZXIiOiIyMDIzLTAzLTE1IiwibWFuYWdlZEJ5IjoiU29mdHdhcmUgRW5naW5lZXJpbmcifQ=="
          - "customEmailSubject"       = "Draft store - bad response codes detected"
          - "frequencyInMinutes"       = "5"
          - "location"                 = "UK South"
          - "severityLevel"            = "3"
          - "timeWindowInMinutes"      = "5"
          - "triggerThreshold"         = "0"
          - "triggerThresholdOperator" = "GreaterThan"
        } -> null
      - resource_group_name = "draft-store-service-sandbox" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "string"
                    }
                  - actionGroupRg            = {
                      - type = "string"
                    }
                  - alertDesc                = {
                      - type = "string"
                    }
                  - alertName                = {
                      - type = "string"
                    }
                  - appInsightsName          = {
                      - type = "string"
                    }
                  - appInsightsQuery         = {
                      - type = "string"
                    }
                  - commonTags               = {
                      - type = "string"
                    }
                  - customEmailSubject       = {
                      - type = "string"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - location                 = {
                      - type = "string"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "string"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "string"
                    }
                  - triggerThreshold         = {
                      - type = "string"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - additionalTags = {
                      - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  - tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null

      - timeouts {}
    }

  # module.db.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "rpe-draft-store-sandbox"
      + resource_group_name = "rpe-draft-store-data-sandbox"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.db.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/rpe-draft-store-data-sandbox"
        name     = "rpe-draft-store-data-sandbox"
      ~ tags     = {
          ~ "expiresAfter"        = "2023-03-15" -> "3000-01-01"
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.db.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/rpe-draft-store-data-sandbox/providers/Microsoft.Resources/deployments/rpe-draft-store-sandbox"
        name                = "rpe-draft-store-sandbox"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZHJhZnQtc3RvcmUuZ2l0IiwiYXBwbGljYXRpb24iOiJjb3JlIiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNwbGF0b3BzLWhlbHAiLCJlbnZpcm9ubWVudCI6InNhbmRib3giLCJleHBpcmVzQWZ0ZXIiOiIyMDIzLTAzLTE1IiwibWFuYWdlZEJ5IjoiU29mdHdhcmUgRW5naW5lZXJpbmcifQ==" -> "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZHJhZnQtc3RvcmUuZ2l0IiwiYXBwbGljYXRpb24iOiJjb3JlIiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNwbGF0b3BzLWhlbHAiLCJlbnZpcm9ubWVudCI6InNhbmRib3giLCJleHBpcmVzQWZ0ZXIiOiIzMDAwLTAxLTAxIiwibWFuYWdlZEJ5IjoiU29mdHdhcmUgRW5naW5lZXJpbmcifQ=="
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox"
        name                            = "draft-store-sandbox"
      ~ tags                            = {
          ~ "expiresAfter"        = "2023-03-15" -> "3000-01-01"
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.KeyVault/vaults/draft-store-sandbox|draft-store-sandbox"
        name                       = "draft-store-sandbox"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/draft-store-service-sandbox/providers/Microsoft.DBforPostgreSQL/flexibleServers/rpe-draft-store-v14-sandbox"
        name                          = "rpe-draft-store-v14-sandbox"
      ~ tags                          = {
          ~ "expiresAfter"        = "2023-03-15" -> "3000-01-01"
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1224,"Program":"tfcmt","SHA1":"","Vars":{}} -->